const segment = {
    basic: 'سهل',
    medium: 'متوسط',
    advanced: 'صعب',
  };
  
  const quiz = {
    quizTitle: ' الفصل الاول و الثاني',
    quizSynopsis: '',
   "questions": [
    {
      "answers": [
        "صح",
        "خطأ"
      ],
      "question": "يطلق علي مدخل الحقبه التاريخيه الطريقه العريضه في دراسه تاريخ التربيه او الفكر التربوي",
      "questionType": "text",
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط",
      "point": "1"
    },
    {
      "answers": [
        "صح",
        "خطأ"
      ],
      "question": "مدخل الحقبه التاريخيه يحقق الوحده الفكريه؟",
      "questionType": "text",
      "correctAnswer": "2",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹\nيفتقر إلى الوحدة الفكرية",
      "point": "1"
    },
    {
      "answers": [
        "مدخل المفكرين التربويين",
        "مدخل القضايا التربويه",
        "مدخل الحقبة التاريخية",
        "جميع ما سبق"
      ],
      "questionType": "text",
      "question": "يعتمد دراسه تاريخ التربيه او الفكر التربوي قضيه معينه من قضايا التربيه ويتتبعها عبر التاريخ؟",
      "correctAnswer": "2",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1"
    },
    {
      "answers": [
        "صح ",
        "خطأ "
      ],
      "question": "يطلق على مدخل القضايا التربويه الطريقه العريضه في دراسه تاريخ التربيه؟",
      "questionType": "text",
      "correctAnswer": "2",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "explanation": "الطريقه الطولية",
      "point": "1"
    },
    {
      "answers": [
        "تقديم كافه الاراء والافكار الخاصه بقضيه في اطار موحد",
        "يتيح للقارئ فرصه تتبع الاحداث والتطور التربوي",
        "الاشاره الى الظروف المجتمعيه من نظم اقتصاديه",
        "يحقق الوحده الفكريه"
      ],
      "question": "يتميز مدخل القضايا التربويه بالاتي ما عدا؟",
      "questionType": "text",
      "correctAnswer": "3",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1"
    },
    {
      "answers": [
        "صح ",
        "خطأ "
      ],
      "question": "يؤخذ على مدخل القضايا التربويه كثره التكرار وصعوبه الاشاره الى الظروف الاجتماعيه من نظم اقتصاديه وسياسيه ونمط ثقافي وبناء اجتماعي؟",
      "questionType": "text",
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1"
    },
    {
      "answers": [
        "مدخل القضايا التربويه",
        "مدخل المفكرين التربويين",
        "مدخل الثقافي",
        "مدخل الحقبه التاريخيه"
      ],
      "question": "مدخل محور دراسه حياه وافراد واعلام التربيه واسلوب اكثر جاذبيه تشويقا للقارئ او الطالب؟",
      "questionType": "text",
      "correctAnswer": "2",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط يا فاشل 🥹🥺😂",
      "point": "1"
    },
    {
      "answers": [
        "صح",
        "خطأ "
      ],
      "point": "1",
      "messageForCorrectAnswer": "براافو 🔥",
      "question": "يؤخذ على مدخل المفكرين التربويين افتقار الشعور بالاتصال الزماني والمكاني ويجعل القارئ غير قادر على تتبع الخطوط الرئيسيه لأتجاهات الفكر التربوي؟",
      "questionType": "text",
      "correctAnswer": "1",
      "messageForIncorrectAnswer": "هتسقط يا فاشل 🥹🥺😂\n"
    },
    {
      "answers": [
        "صح",
        "خطأ "
      ],
      "question": "يري البعض ان الكتابات التقليديه في تاريخ الفكر التربوي قد نجحت في الربط بين الماضي؟",
      "questionType": "text",
      "correctAnswer": "2",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط يا فاشل 🥹🥺😂\nفشلت في الربط ",
      "point": "1"
    },
    {
      "answers": [
        "صح",
        "خطأ "
      ],
      "question": "حاول بطاطس الربط بين طريق الزمنيه وطريقه القضايا والطريقه الثقافيه في دراسه تاريخ التربيه؟",
      "questionType": "text",
      "correctAnswer": "2",
      "messageForCorrectAnswer": "برااافو يلا مركز 😂😂",
      "messageForIncorrectAnswer": "شربتها يا كروكيت 🥹🥺😂\nهى صح بس كلمة بطاطس غلط 😂😂😂",
      "point": "1"
    },

    {
      "question": "التوجهات السياسيه ونوعيه السلطه الحاكمه كانت عاملا رئيسا في تشكيل الفكر التربوي وهذا يعني العامل السياسي لدراسه تاريخ التربيه؟",
      "answers": [
        "صح",
        "خطأ"
      ],
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1",
      "questionType": "text"
    },
    {
      "question": "العامل السياسي والعامل الحاسم في تشكيل النظم التربويه؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "خطأ"
      ],
      "correctAnswer": "2",
      "explanation": "العامل الاقتصادي",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "messageForCorrectAnswer": "برااافو 🔥",
      "point": "1"
    },
    {
      "question": "العامل الاجتماعي هو حياه المجتمع من حيث هو مجتمع  رأس مالي او اشتراكي وهل هو مجتمع ذو صلات مفتوحه او انعزالي منغلق؟",
      "answers": [
        "صح",
        "خطأ"
      ],
      "questionType": "text",
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1"
    },
    {
      "question": "هناك عده اساليب او مداخل لدراسه تاريخ التربيه و الفكر التربوي  منها....",
      "questionType": "text",
      "answers": [
        "مدخل القضايا التربويه",
        "مدخل الحقبة التاريخيه",
        "مدخل المفكرين التربويين",
        "جميع ما سبق"
      ],
      "correctAnswer": "4",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1"
    },
    {
      "question": "مدخل يجعل التقسيم الزمني محور الدراسه في تاريخ الفكر التربوي؟",
      "questionType": "text",
      "answers": [
        "مدخل الحقبة التاريخيه",
        "مدخل القضايا التربويه",
        "مدخل المفكرين التربويين",
        "جميع ما سبق"
      ],
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برااافو 🔥",
      "messageForIncorrectAnswer": "هتسقط 🥺🥹",
      "point": "1"
    },

    {
      "question": "لتربيه في الوقت الحاضر ما هي إلا نتائج الحصاد قرون عديده من التطور التربوي نظريا وتطبيقيا؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "point": "1"
    },
    {
      "question": ". يعرف الفكر على انه العمليه التي يقوم بها العقل للوصول الى المعرفه والتفكير على انه اشغال الخاطر بشيء ما ويستخدم في الامور المعنويه فقط؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "point": "1",
      "messageForCorrectAnswer": "برافو ي مصحح 😂❤️",
      "messageForIncorrectAnswer": "التصحيح اعكسهم"
    },
    {
      "question": "تاريخ التربيه والفكر التربوي هو تحليل التربيه و معالجتها من المنظور الثقافي؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "التصحيح المنظور التاريخي",
      "point": "1"
    },
    {
      "answers": [
        "نظام الثقافه",
        " نظام تاريخ التربيه ",
        "نظام التربيه",
        " جميع ما سبق"
      ],
      "question": "هو نظام يعني بالممارسات التربويه التي اتبعتها الشعوب والمجتمعات عبر العصور وما ابتداعته من انماط تربويه واساليب اختلفت باختلاف العصور؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "correctAnswer": "3",
      "messageForIncorrectAnswer": "نظام التربيه",
      "point": "1"
    },
    {
      "question": "تعرف التربيه بانها دراسه اراء المفكرين والمربين فيما تركوه في مؤلفاتهم وما ابدعته عقول الفلاسفه والمربين عبر التاريخ؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "التصحيح تاريخ التربيه",
      "messageForCorrectAnswer": "برافو ي مصحح 😂❤️",
      "point": "1"
    },
    {
      "question": " دراسه تاريخ التربيه مهام عديده؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "الاهميه الثقافيه او الاستماع العقلي ",
        "الاهميه الحضاريه والنفعيه ",
        "الاهميه المعرفيه اللغويه ومواجهه المشكلات التربويه المختلفه ",
        "جميع ما سبق"
      ],
      "correctAnswer": "4",
      "messageForIncorrectAnswer": "جميع ما سبق",
      "point": "1"
    },
    {
      "question": "مدخل لزم لمن اراد فهم النظريات والاتجاهات والنظم التربيه في الوقت الحاضر؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "الاهميه الثقافيه",
        " الاهميه الحضاريه ",
        "الاهميه النفعيه ",
        "الاهميه المعرفيه واللغويه"
      ],
      "correctAnswer": "1",
      "messageForIncorrectAnswer": "الاهميه الثقافيه",
      "point": "1"
    },
    {
      "question": "بيقول لك دراسه حضانات الشعوب الاخرى والتعرف على جوانبها المختلفه لمساعده العمليه تربويه في معرفه ما ورثته من الماضي وما اعادته للحاضر وكيف تخطط للمستقبل؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "اهميه الثقافيه",
        " الاهميه الحضاريه ",
        "الاهميه المعرفيه واللغويه",
        " اهميه النفعيه"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " الاهميه الحضاريه ",
      "point": "1"
    },
    {
      "question": "ا الاهميه المعرفيه واللغويه تتمثل في الدروس المستخلصه من دراسه تاريخ التربيه؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " التصحيح الاهميه النفعيه",
      "point": "1"
    },
    {
      "question": "دراسه تاريخ التربيه تمكنا من مواجهه المشكلات التربويه المختلفه؟ ",
      "answers": [
        "صح",
        "غلط"
      ],
      "questionType": "text",
      "answerSelectionType": "single",
      "point": "1",
      "correctAnswer": "1"
    },
    {
"question": "من القوى والعوامل المؤثره في دراسة تاريخ التربيه ما عدا ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        " العوامل الدينيه  ",
        "العوامل الاقتصاديه ",
        "العوامل الاجتماعيه ",
        "العوامل الثقافة"
      ],
      "correctAnswer": "4",
      "messageForIncorrectAnswer": "العوامل الثقافة",
      "point": "1"
    },
    {
      "answers": [
        "صح",
        "غلط"
      ],
      "questionType": "text",
      "answerSelectionType": "single",
      "point": "1",
      "question": "تاريخ التربيه هي نتائج تفاعل العوامل التاريخيه والجغرافيه والدينيه والاقتصاديه واللغويه؟ ",
      "messageForIncorrectAnswer": "التصحيح شخصية الأمة ",
      "correctAnswer": "2"
    },
    {
      "answers": [
        " العامل الديني",
        " العامل الجغرافي ",
        "العامل السياسي ",
        "العامل الاقتصادي"
      ],
      "point": "1",
      "questionType": "text",
      "answerSelectionType": "single",
      "question": "من اهم العناصر التي تشكل ثقافه المجتمعات وتحدد قيم ومفاهيم الافراد وانماط تفكيرهم وعاداتهم ووجهه نظرهم ازاء الحياه والكون والوجود؟",
      "correctAnswer": "1",
      "messageForIncorrectAnswer": " العامل الديني"
    },
    {
      "answerSelectionType": "single",
      "questionType": "text",
      "answers": [
        " العامل الديني ",
        "العامل الاقتصادي ",
        " العامل الاجتماعي ",
        "العامل الجغرافي"
      ],
      "point": "1",
      "question": " يمثل الاطار العام والطبيعي لحياه البشر ونشاطات الجماعه وتاثيرها الكبير على طباعه الافراد وخصائص الجامعات؟",
      "correctAnswer": "4",
      "messageForIncorrectAnswer": "العامل الجغرافي",
      "explanation": " العامل الجغرافي وخاصه عاملي الارض و المناخ",
      "messageForCorrectAnswer": "برافو عليك😂❤️"
    },
    {
      "answers": [
        "صح",
        "غلط"
      ],
      "questionType": "text",
      "answerSelectionType": "single",
      "point": "1",
      "question": "ليس التعليم عاملا تربويا فحسب وانما هو عامل سياسي في المقام الاول؟",
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "messageForIncorrectAnswer": "لية كده م انت 😔😔كنت ماشي حلو"
    },
    {
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "question": "عاشت المجتمعات البدائيه منذ خمسه او سته الاف سنه قبل اختراع الكتابه وقبل ان تصبح للتربيه مدارسها ومؤسستها الخاصه بها؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "point": "1"
    },
    {
      "question": "المجتمع البدايه هو المجتمع متحضر يتصف بالوحدة؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "point": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " غير متحضر يتصف بالعزلة"
    },
    {
      "answers": [
        "صح",
        "غلط"
      ],
      "question": " المجتمع البدائي مجتمع يتصف بعدم التغير والتجانس وعدم التضامن الاجتماعي قوي؟ غلط. ",
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " بالتضامن الاجتماعي القوي",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "point": "1",
      "questionType": "text",
      "answerSelectionType": "single"
    },
    {
      "question": "من بين المميزات العامه للحياه البدائيه نسبه الحياه الي ........ اثناء تفسيرهم للبيئه المحيطه بهم؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "الحيوان ",
        "الروح",
        " الجماد",
        " النبات"
      ],
      "correctAnswer": "3",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "messageForIncorrectAnswer": "الجماد"
    },
    {
      "question": "كان الرجل البدايه يعتقد ان وراء كل قوه ماديه قوه اخرى غير ماديه وهي القوه الروحيه؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "messageForIncorrectAnswer": "فوق ع الدكتور هيزعلنه 😂😂🙆‍♂️🙆‍♂️"
    },
    {
      "question": "اول جماعه انسانيه كانت مكونه من افراد لم تجمعهم رابطه القربة وانما جمعتهم الصدفه او الحاجه الى دفع الاخطار تعرف انصار القبيلة؟ صح .",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "messageForCorrectAnswer": "ايوه كده فوق ع الدكتور هيعمل معانا الصح 😂❤️",
      "messageForIncorrectAnswer": "م قولتلك فوق ي ابني 😂😂",
      "point": "1"
    },
    {
      "question": "جماعه كانت تأد المواليد الاناث وتبقى على الذكور بحجه انهم اقدر على درء الخطر والحصول على القوت؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "انصار العشيره التوتميه",
        " انصار القبيله",
        " انصار الاسره ",
        "جميع ما سبق "
      ],
      "correctAnswer": "2",
      "point": "1"
    },
    {
      "question": "انصار الاسره هي الخليه الاجتماعيه الاولى لا تربطهم صله القرابه وانما تجمعهم صلة روحيه؟ غلط. ",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "انصار العشيره التوتمية ",
      "point": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "questionType": "text",
      "answerSelectionType": "single"
    },
    {
      "question": "اعتقاد انصار العشيره التوتمية انهم جميعهم ينحدرون من توتم واحد هو جدهم الاعلى وفي العاده حيوان او نبات وياخذونه شعارا لهم؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "point": "1"
    },
    {
      "question": "القبيله الخليه الاجتماعيه الاولى وتربط بينهم صله القرابه وتجمعهم سلطة رب الاسره؟",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " انصار الاسره",
      "point": "1",
      "messageForCorrectAnswer": "ايوه كده فرحنه😂❤️",
      "questionType": "text",
      "answerSelectionType": "single"
    },
    {
      "question": "في المجتمعات البدائيه من يحكم القبيله هي الاسره؟  . ",
      "questionType": "text",
"answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " شيخها وكبير العشيره.",
      "messageForCorrectAnswer": "ايوه كده فرحنه😂❤️"
    },
    {
      "question": "من ملامح الاقتصاد في المجتمعات البدائيه اقتصادا بسيط انتاجي ثم تحول مع ظهور الزراعه الى استهلاكي؟ غلط . ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "استهلاكي ثم تحول انتاجي ",
      "messageForCorrectAnswer": "كده انت فايق 😂❤️",
      "point": "1"
    },
    {
      "question": "تتم التربيه وتحدث في واقع الحياه مباشره اي تتم بطريقه مقصوده؟ ",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " بطريقه غير مقصودة",
      "messageForCorrectAnswer": "كده انت فايق اوووي 😂❤️",
      "point": "1",
      "questionType": "text"
    },
    {
      "question": "الحياه كلها هي نمط التربيه في المجتمعات البدائيه؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "explanation": " التفسير لانها لا يوجد فرد بعينه يتولى امر التربيه ولا يوجد اهداف  مخطط لها مسبقا ولا توجد مؤسسات متخصصه",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "point": "1"
    },
    {
      "question": "كانت التربيه في المجتمعات البدائيه مرادفه للحياه؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "explanation": "التفسير لان كانت اهداف التربيه هي اهداف تلك الحياه فى المجتمعات البدائية ",
      "messageForCorrectAnswer": "برافو عليك اوي اوي 😂❤️",
      "point": "1",
      "messageForIncorrectAnswer": "لا كده انت مش مركز والدكتور هيزعلنا 🙆‍♂️🙆‍♂️"
    },
    {
      "question": "هدف التربيه في المجتمعات الفرعونيه ان يقلد الناشئ عادات مجتمعه عبودياً خاصاً وتحقيق التوافق وانسجام بين الفرد وبيئته الماديه والروحيه؟ ",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "هدف التربيه في المجتمعات البدائية ",
      "point": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "answerSelectionType": "single",
      "questionType": "text"
    },
    {
      "question": "كانت التربيه في المجتمعات البدائيه معقده وصعبه في وسائلها وقلت مطالبها؟ ",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " تمتاز ببساطتها وبدائية وسائلها وقله مطالبها",
      "point": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "questionType": "text"
    },
    {
      "question": "تبقى التربيه البدئيه تنقسم الى نوعين؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "explanation": " التفسير التربيه العمليه والتربيه النظريه",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "correctAnswer": "1"
    },
    {
      "question": "التربيه النظريه تعتمد على تنمية القدره الجسمانيه للانسان ومنح الحريه للاطفال في اكتشاف الكون من حولهم؟  ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "التربيه العمليه",
      "point": "1"
    },
    {
      "question": " كانت من اختصاصات شيخ القبيله او الكاهن المنوط باقامه الشعائر الدينيه وتحدث من خلال اقامه الحفلات التي يمارس فيها الطقوس المناسبه للعقيده الخاصه بالقوم؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "التربيه الفكريه",
        " التربيه النظريه",
        "التربيه العمليه ",
        "ليس مما سبق"
      ],
      "correctAnswer": "2",
      "point": "1",
      "messageForIncorrectAnswer": " التربيه النظريه"
    },
    {
      "question": " اشكال التربيه في المجتمعات البدائيه ما عدا؟ ",
      "questionType": "text",
"answerSelectionType": "single",
      "answers": [
        "التربيه الجسديه ",
        " التربيه العمليه",
        "التربيه الخلقيه ",
        "التربيه الفكريه"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": " التربيه العمليه",
      "point": "1"
    },
    {
      "question": "التربيه الجسديه تسهم في تكوين الفكري عن طريق شحذ قبليات الملاحظه والتخيل والابداع عند الفرد؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "point": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️"
    },
    {
      "question": " التربيه العمليه تربيه يغلب على عليها الطابع العملي وهدفها ان تجعل الطفل قادرا على تلبيه حاجاته ثم حياه اسرتهم من بعد؟ ",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "التربيه الفكريه",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "point": "1",
      "questionType": "text"
    },
    {
      "question": "من خصائص التربيه البدائيه؟ ",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "كانت متدرجه ومرحليه ",
        " تقوم على المحاكاه والتقليد ",
        " الحياه هي التعلم ",
        "جميع ما سبق"
      ],
      "correctAnswer": "4",
      "messageForIncorrectAnswer": "جميع ما سبق",
      "point": "1"
    },
    {
      "question": "تميزت تميزت الحياه البدائي بالتخصيص اي ان المجتمع بكامله يقوم بالعمليه التربويه؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "2",
      "messageForIncorrectAnswer": "تميزت بالتوزيع",
      "point": "1"
    },
    {
      "question": "الاساس الذي تقوم عليه الاعداد لعمية المواطنه في المجتمعات البدائيه اتصال الجيل الصغير بالجيل الكبير اتصالا مباشرا ؟",
      "questionType": "text",
      "answerSelectionType": "single",
      "answers": [
        "صح",
        "غلط"
      ],
      "correctAnswer": "1",
      "messageForCorrectAnswer": "برافو عليك😂❤️",
      "point": "1"
    }
  ]
  };
  
  export default quiz;
  